Tekla Open API Reference for Tekla Structures 2025
ModelObject.GetStringReportProperties Method
 Retrieves multiple string report properties for the model object. It is faster to fetch multiple properties at once.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool GetStringReportProperties(
	ArrayList names,
	ref Hashtable values
)
Public Function GetStringReportProperties (
	names As ArrayList,
	ByRef values As Hashtable
) As Boolean
Parameters
names
Type: System.Collections.ArrayList
An array list containing the names of the properties.
values
Type: System.Collections.Hashtable
The return value, a hash table that contains all the values that were retrieved successfully.
Return Value
Type: Boolean
True if at least one single property was retrieved successfully.
See Also
Reference
ModelObject Class
Tekla.Structures.Model Namespace